apojomovsky/epic-hal/epic-math/src/pic16/pic_math_addsub.c
/*
 * PIC16 inline-asm add/sub/negate primitives. Mid-range PIC16 has no
 * addwfc/subwfb, so the low-byte carry/borrow is folded into the high
 * byte's addend with addlw 1 (never a skip: an incfsz that wraps on
 * b_hi == 0xFF would drop the a_hi term), and the addend wrap is saved
 * into the carry-out byte with rlf so both the result and the
 * carry/borrow out are correct for every input (verified by
 * instruction-level simulation over the full high-byte space).
 * STATUS bits by number (C=0, Z=2). Operands live in the shared scratch
 * buffer (pic_math_scratch.h), one banksel per routine.
 */

#include <xc.h>
#include "pic_math.h"
#include "pic_math_scratch.h"

/**
 * @brief  16-bit unsigned add with carry out (PIC16 inline asm).
 * @param  a           augend, 0..65535
 * @param  b           addend, 0..65535
 * @param  carry_out  set true on overflow (sum > 65535); may be NULL.
 * @return (a + b) truncated to 16 bits.
 *
 * 16-bit add. Low bytes add (sets C); the high addend is folded with the
 * carry via addlw 1 (movf preserves C), and the addend wrap is OR-ed
 * into the carry out so both the sum and the carry are correct for every
 * input. Worked example 0xFFFF+0x0002 -> 0x0001, carry 1. Offsets a@0,
 * b@2, r@4, co@6. */
uint16_t pic_math_add_u16(uint16_t a, uint16_t b, bool *carry_out) __at(0x2E0)
{
    pic16_mscratch[0] = (uint8_t)a;           pic16_mscratch[1] = (uint8_t)(a >> 8);
    pic16_mscratch[2] = (uint8_t)b;           pic16_mscratch[3] = (uint8_t)(b >> 8);
    pic16_mscratch[6] = 0u;
    asm("banksel _pic16_mscratch");
    asm("movf  _pic16_mscratch+2,w");
    asm("addwf _pic16_mscratch+0,w");
    asm("movwf _pic16_mscratch+4");
    asm("movf  _pic16_mscratch+3,w");
    asm("btfsc STATUS,0");
    asm("addlw 1");                     /* W = b_hi + carry; C = wrap */
    asm("rlf   _pic16_mscratch+6,f");   /* co bit0 = wrap */
    asm("movwf _pic16_mscratch+5");     /* folded addend */
    asm("movf  _pic16_mscratch+1,w");
    asm("addwf _pic16_mscratch+5,w");   /* W = a_hi + folded; C = C_add */
    asm("movwf _pic16_mscratch+5");
    asm("rlf   _pic16_mscratch+6,f");   /* co = (wrap<<1) | C_add */
    asm("movf  _pic16_mscratch+6,w");
    asm("clrf  _pic16_mscratch+6");
    asm("andlw 0x03");
    asm("btfss STATUS,2");              /* skip setf if no wrap and no C_add */
    asm("setf  _pic16_mscratch+6");
    if (carry_out) *carry_out = (bool)pic16_mscratch[6];
    return (uint16_t)pic16_mscratch[4] | ((uint16_t)pic16_mscratch[5] << 8);
}

/**
 * @brief  16-bit unsigned subtract with borrow out (PIC16 inline asm).
 * @param  a           minuend, 0..65535
 * @param  b           subtrahend, 0..65535
 * @param  borrow_out  set true on underflow (a < b); may be NULL.
 * @return (a - b) truncated to 16 bits.
 *
 * a - b, borrow_out = (a < b). Low bytes subtract (C=0 on borrow); the
 * high byte subtracts b_hi plus the borrow, folded via addlw 1, with the
 * addend wrap OR-ed into the borrow out. Offsets a@0, b@2, r@4, bo@6. */
uint16_t pic_math_sub_u16(uint16_t a, uint16_t b, bool *borrow_out) __at(0x320)
{
    pic16_mscratch[0] = (uint8_t)a;           pic16_mscratch[1] = (uint8_t)(a >> 8);
    pic16_mscratch[2] = (uint8_t)b;           pic16_mscratch[3] = (uint8_t)(b >> 8);
    pic16_mscratch[6] = 0u;
    asm("banksel _pic16_mscratch");
    asm("movf  _pic16_mscratch+2,w");
    asm("subwf _pic16_mscratch+0,w");
    asm("movwf _pic16_mscratch+4");
    asm("movf  _pic16_mscratch+3,w");
    asm("btfsc STATUS,0");
    asm("goto  _m_sub_nofold");         /* no borrow (C=1): addend stays b_hi */
    asm("addlw 1");                     /* W = b_hi + borrow; C = wrap */
    asm("rlf   _pic16_mscratch+6,f");   /* co bit0 = wrap */
    asm("_m_sub_nofold:");
    asm("movwf _pic16_mscratch+5");     /* folded addend */
    asm("movf  _pic16_mscratch+5,w");
    asm("subwf _pic16_mscratch+1,w");   /* W = a_hi - folded; C = no-borrow */
    asm("movwf _pic16_mscratch+5");
    asm("rlf   _pic16_mscratch+6,f");   /* co = (wrap<<1) | C */
    asm("movf  _pic16_mscratch+6,w");
    asm("clrf  _pic16_mscratch+6");
    asm("andlw 0x03");
    asm("sublw 1");                     /* skip setf only when no borrow, no wrap */
    asm("btfss STATUS,2");
    asm("setf  _pic16_mscratch+6");
    if (borrow_out) *borrow_out = (bool)pic16_mscratch[6];
    return (uint16_t)pic16_mscratch[4] | ((uint16_t)pic16_mscratch[5] << 8);
}

/**
 * @brief  16-bit two's-complement negate (PIC16 inline asm).
 * @param  v  value to negate, -32768..32767
 * @return -v; INT16_MIN negates to itself (two's-complement wrap).
 *
 * -v = ~v + 1: complement both bytes, inc low, and inc high only if the
 * low inc wrapped (Z). INT16_MIN negates to itself. Offsets v@0, r@2. */
int16_t pic_math_negate_s16(int16_t v) __at(0x360)
{
    uint16_t uv = (uint16_t)v;
    pic16_mscratch[0] = (uint8_t)uv;          pic16_mscratch[1] = (uint8_t)(uv >> 8);
    asm("banksel _pic16_mscratch");
    asm("comf  _pic16_mscratch+0,w");
    asm("movwf _pic16_mscratch+2");
    asm("comf  _pic16_mscratch+1,w");
    asm("movwf _pic16_mscratch+3");
    asm("incf  _pic16_mscratch+2,f");
    asm("btfsc STATUS,2");
    asm("incf  _pic16_mscratch+3,f");
    return (int16_t)((uint16_t)pic16_mscratch[2] | ((uint16_t)pic16_mscratch[3] << 8));
}

/**
 * @brief  32-bit two's-complement negate (PIC16 inline asm).
 * @param  v  value to negate, -2147483648..2147483647
 * @return -v; INT32_MIN negates to itself (two's-complement wrap).
 *
 * Same ~v + 1 with the carry cascade across 4 bytes. Offsets v@0-3, r@4-7. */
int32_t pic_math_negate_s32(int32_t v) __at(0x380)
{
    uint32_t uv = (uint32_t)v;
    pic16_mscratch[0] = (uint8_t)uv;          pic16_mscratch[1] = (uint8_t)(uv >> 8);
    pic16_mscratch[2] = (uint8_t)(uv >> 16);  pic16_mscratch[3] = (uint8_t)(uv >> 24);
    asm("banksel _pic16_mscratch");
    asm("comf  _pic16_mscratch+0,w");  asm("movwf _pic16_mscratch+4");
    asm("comf  _pic16_mscratch+1,w");  asm("movwf _pic16_mscratch+5");
    asm("comf  _pic16_mscratch+2,w");  asm("movwf _pic16_mscratch+6");
    asm("comf  _pic16_mscratch+3,w");  asm("movwf _pic16_mscratch+7");
    asm("incf  _pic16_mscratch+4,f");
    asm("btfsc STATUS,2");
    asm("incf  _pic16_mscratch+5,f");
    asm("btfsc STATUS,2");
    asm("incf  _pic16_mscratch+6,f");
    asm("btfsc STATUS,2");
    asm("incf  _pic16_mscratch+7,f");
    return (int32_t)((uint32_t)pic16_mscratch[4] | ((uint32_t)pic16_mscratch[5] << 8)
                   | ((uint32_t)pic16_mscratch[6] << 16) | ((uint32_t)pic16_mscratch[7] << 24));
}
